#### Terraform Format and Style 🖌 (dev) `success`
#### Terraform Initialization ⚙️ (dev) `success`
#### Terraform Validation 🤖 (dev) `success`
#### Terraform Plan 📖 (dev) `success`

<details><summary>Show Plan (dev)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudwatch-sns.aws_cloudwatch_metric_alarm.influxdb_daily_backup_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "influxdb_daily_backup_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when IncrementalBackup Lambda has errors"
      + alarm_name                            = "revolution-dev-DailyBackupErrors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "revolution-dev-influxdb-daily-backup"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + region                                = "eu-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.cloudwatch-sns.aws_cloudwatch_metric_alarm.influxdb_monthly_backup_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "influxdb_monthly_backup_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when InfluxdbMonthlyBackup Lambda has errors"
      + alarm_name                            = "revolution-dev-InfluxMonthlyBackupErrors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "revolution-dev-influxdb-monthly-backup"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + region                                = "eu-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.cloudwatch-sns.aws_sns_topic.influxdb_backup_alarms will be created
  + resource "aws_sns_topic" "influxdb_backup_alarms" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "revolution-dev-InfluxdbBackupAlarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.cloudwatch-sns.aws_sns_topic_policy.backup_alarms_policy will be created
  + resource "aws_sns_topic_policy" "backup_alarms_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "eu-west-2"
    }

  # module.cloudwatch-sns.aws_sns_topic_subscription.backup_alarms_email will be created
  + resource "aws_sns_topic_subscription" "backup_alarms_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "david.achoja@dumarey.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "eu-west-2"
      + topic_arn                       = (known after apply)
    }

  # module.cloudwatch_event.aws_cloudwatch_event_rule.daily_backup will be created
  + resource "aws_cloudwatch_event_rule" "daily_backup" {
      + arn                 = (known after apply)
      + description         = "rule to trigger lambda function to backup daily to s3"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "revolution-dev-daily-influxdb-backup"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(10 3 * * ? *)"
      + tags                = {
          + "Name" = "revolution-dev-daily-influxdb-backup"
        }
      + tags_all            = {
          + "Name" = "revolution-dev-daily-influxdb-backup"
        }
    }

  # module.cloudwatch_event.aws_cloudwatch_event_rule.monthly_backup will be created
  + resource "aws_cloudwatch_event_rule" "monthly_backup" {
      + arn                 = (known after apply)
      + description         = "rule to trigger lambda function to backup to s3 monthly"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "revolution-dev-monthly-influxdb-backup"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(0 3 3 * ? *)"
      + tags                = {
          + "Name" = "revolution-dev-monthly-influxdb-backup"
        }
      + tags_all            = {
          + "Name" = "revolution-dev-monthly-influxdb-backup"
        }
    }

  # module.cloudwatch_event.aws_cloudwatch_event_target.daily_target will be created
  + resource "aws_cloudwatch_event_target" "daily_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-west-2"
      + rule           = "revolution-dev-daily-influxdb-backup"
      + target_id      = "influxdb-backup-daily-lambda"
    }

  # module.cloudwatch_event.aws_cloudwatch_event_target.monthly_target will be created
  + resource "aws_cloudwatch_event_target" "monthly_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-west-2"
      + rule           = "revolution-dev-monthly-influxdb-backup"
      + target_id      = "influxdb-backup-monthly-lambda"
    }

  # module.cloudwatch_event.aws_lambda_permission.allow_eventbridge_daily will be created
  + resource "aws_lambda_permission" "allow_eventbridge_daily" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "revolution-dev-influxdb-daily-backup"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridgeDaily"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_event.aws_lambda_permission.allow_eventbridge_monthly will be created
  + resource "aws_lambda_permission" "allow_eventbridge_monthly" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "revolution-dev-influxdb-monthly-backup"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridgeMonthly"
      + statement_id_prefix = (known after apply)
    }

  # module.lambdas.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "revolution-dev-lambda_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambdas.aws_iam_role_policy.lambda_backup_s3_policy will be created
  + resource "aws_iam_role_policy" "lambda_backup_s3_policy" {
      + id          = (known after apply)
      + name        = "revolution-dev-influxdb-lambda-backup-s3-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambdas.aws_lambda_function.influxdb_daily_backup will be created
  + resource "aws_lambda_function" "influxdb_daily_backup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambdas/influxdb_daily_backup.zip"
      + function_name                  = "revolution-dev-influxdb-daily-backup"
      + handler                        = "influxdb_daily_backup.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "rriHaTr6Q/aU+Cgl7MR+y45YFvFrsm4aOAgVeZ41kPo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "revolution-dev-influxdb-daily-backup"
        }
      + tags_all                       = {
          + "Name" = "revolution-dev-influxdb-daily-backup"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 2048
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambdas.aws_lambda_function.influxdb_daily_restore will be created
  + resource "aws_lambda_function" "influxdb_daily_restore" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambdas/influxdb_daily_restore.zip"
      + function_name                  = "revolution-dev-influxdb-daily-restore"
      + handler                        = "influxdb_daily_restore.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Tr7nf5QehpJiZYgdQFraPNOFBeEBr3nW4QugYAdCyrQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "revolution-dev-influxdb-daily-restore"
        }
      + tags_all                       = {
          + "Name" = "revolution-dev-influxdb-daily-restore"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambdas.aws_lambda_function.influxdb_monthly_backup will be created
  + resource "aws_lambda_function" "influxdb_monthly_backup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambdas/influxdb_monthly_backup.zip"
      + function_name                  = "revolution-dev-influxdb-monthly-backup"
      + handler                        = "influxdb_monthly_backup.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "FvomcUL0V7GXWs5+nx/Xl5saOr5Wb2UlBLovbIq/RNo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "revolution-dev-influxdb-monthly-backup"
        }
      + tags_all                       = {
          + "Name" = "revolution-dev-influxdb-monthly-backup"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambdas.aws_lambda_function.influxdb_monthly_restore will be created
  + resource "aws_lambda_function" "influxdb_monthly_restore" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambdas/influxdb_monthly_restore.zip"
      + function_name                  = "revolution-dev-influxdb-monthly-restore"
      + handler                        = "influxdb_monthly_restore.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "1ZYVlFQi+NeFlnsluWtoR/WyAMPEXGFZeOUgryHfNcg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "revolution-dev-influxdb-monthly-restore"
        }
      + tags_all                       = {
          + "Name" = "revolution-dev-influxdb-monthly-restore"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambdas.aws_lambda_layer_version.influxdb_cli_layer will be created
  + resource "aws_lambda_layer_version" "influxdb_cli_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_architectures    = [
          + "x86_64",
        ]
      + compatible_runtimes         = [
          + "python3.13",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../modules/lambdas/influxdb-cli-layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "revolution-dev-influxdb-cli"
      + region                      = "eu-west-2"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.s3.aws_s3_bucket.influxdb_backup_bucket will be created
  + resource "aws_s3_bucket" "influxdb_backup_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "revolution-dev-influxdb-backup-bucket-aaa"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "revolution-dev-influxdb-backup-bucket"
        }
      + tags_all                    = {
          + "Name" = "revolution-dev-influxdb-backup-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_lifecycle_configuration.influxdb_backup_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "influxdb_backup_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "eu-west-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "FullBackupRetention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 120
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "influx-backups/monthly/"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }
      + rule {
          + id     = "DailyBackupRetention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 35
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "influx-backups/daily/"
            }
        }
    }

  # module.s3.aws_s3_bucket_policy.influxdb_backup_policy will be created
  + resource "aws_s3_bucket_policy" "influxdb_backup_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "eu-west-2"
    }

  # module.s3.aws_s3_bucket_public_access_block.influxdb_backup_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "influxdb_backup_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-2"
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.backups_bucket_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "backups_bucket_encryption" {
      + bucket = "revolution-dev-influxdb-backup-bucket-aaa"
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.influxdb_backup_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "influxdb_backup_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_destination will be created
  + resource "aws_secretsmanager_secret" "influxdb_backup_token_destination" {
      + arn                            = (known after apply)
      + description                    = "the token created for the first user in the InfluxDB setup process"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "revolution-dev-InfluxdbDestinationRootToken"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-west-2"
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_source will be created
  + resource "aws_secretsmanager_secret" "influxdb_backup_token_source" {
      + arn                            = (known after apply)
      + description                    = "The token created for the first user in the InfluxDB setup process"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "revolution-dev-InfluxdbSourceRootToken"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-west-2"
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_destination will be created
  + resource "aws_secretsmanager_secret_version" "influxdb_backup_token_version_destination" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-west-2"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_source will be created
  + resource "aws_secretsmanager_secret_version" "influxdb_backup_token_version_source" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-west-2"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Terraform multi-environment deployments`, Environment: `dev`*